Repository: adamatan/flip_classroom_hackathon
Catalog: web/flipped/locale/*/LC_MESSAGES/django.po
Languages: he

source: contact us
he: צור קשר

source: Welcome
he: שיעור פתוח

source: Please feel free to view the video items
he: שיעור פתוח הוא מאגר סרטונים לימודיים שמשתמשים יוצרים, המאורגן לפי תוכנית הלימודים בישראל

source: Uploaded recently:
he: הועלה לאחרונה:

source: published
he: הועלה ב-

source: teachers guide
he: שיעור הפוך - מדריך למורה

source: about us
he: אודות

source: want to help?
he: רוצה לעזור?

source: Open Class
he: שיעור פתוח

source: Search box
he: תיבת חיפוש

source: Search
he: חפש

source: Syllabuses
he: סילבוסים

source: Mathematics 5 units
he: מתמטיקה 5 יחֿֿ"ל

source: Mathematics 4 units
he: מתמטיקה 4 יחֿֿ"ל

source: Mathematics 3 units
he: מתמטיקה 3 יחֿֿ"ל

source: upload video
he: העלאת סרטון

source: Creators area
he: אזור היוצרים

source: my videos
he: הסרטונים שלי

source: log out
he: התנתק

source: John's syllabus
he: הסרטונים הנבחרים של משה

source: Home
he: דף הבית

source: help
he: עזרה

source: Syllabus
he: דף הנבחרים

source: subtitles
he: כתוביות

source: video duration
he: משך

source: Invalid YouTube URL
he: יש להזין כתובת יוטיוב תקינה

source: Video could not be found on YouTube for ID: %(id)s
he: לא נמצא סרטון יוטיוב עם מזהה: %(id)s

source: Video already exists: %(url)s
he: סרטון קיים: %(url)s

source: link
he: קישור

source: title
he: כותרת

source: content
he: תוכן

source: category
he: סוג סרט

source: item
he: נושא לימוד

source: email
he: דואל

source: Save
he: שמירה

source: Promote
he: קידום

source: Delete
he: מחיקה

source: Save as new
he: שמירה כחדש

source: Save and add another
he: שמירה והוספת אחר

source: Save and continue editing
he: שמירה והמשך עריכה

source: Add
he: הוסף

source: By %(channel)s, uploaded by %(user_name)s
he: מאת %(channel)s, הועלה ע"י %(user_name)s

source: Be the first to upload a video
he: רוצים להיות הראשונים? העלו סרטון

source: Search page
he: דף חיפוש

source: more
he: עוד

source: %(category)s by %(youtube_channel)s
he: %(category)s מאת %(youtube_channel)s

source: hello
he: שלום

source: the videos you uploaded:
he: הסרטונים שלך:

source: technical quality
he: איכות טכנית

source: relevancy
he: רלוונטיות

source: change your password
he: שנה את סיסמתי

source: By <a href="https://www.youtube.com/channel/%(channel_id)s">%(channel)s</a>, uploaded by %(user_name)s on %(day)s %(month)s %(year)s
he: מאת <a href="https://www.youtube.com/channel/%(channel_id)s">%(channel)s</a>, הועלה ע"י %(user_name)s בתאריך %(day)s ב%(month)s %(year)s

source: edit
he: ערוך

source: Help us improve our website
he: עזרו לנו לצמוח

source: Is this video suitable for this topic?
he: האם גם הסרטון הזה מתאים לנושא?

source: Yes
he: כן

source: No
he: לא

source: Thank you!
he: תודה רבה!

source: Previous
he: הקודם:

source: More
he: עוד:

source: Next
he: הבא:

source: Results for %(q)s
he: תוצאות עבור %(q)s

source: username
he: שם משתמש

source: password
he: סיסמא

source: first_name
he: שם פרטי

source: last_name
he: שם משפחה

source: Please login
he: אנא התחבר

source: Your username and password didn't match. Please try again.
he: שם המשתמש או הסיסמה שגויים

source: Login
he: התחבר

source: Please register
he: אנא הרשם

source: Register
he: הרשם

source: Please correct the error below.
he: נא לתקן את השגיאה מתחת.

source: Password change
he: שינוי סיסמא

source: Please enter your old password, for security's sake, and then enter your new password twice so we can verify you typed it in correctly.
he: נא להזין את סיסמתך הישנה, לצרכי אבטחה, ולאחר מכן את סיסמתך החדשה פעמיים כדי שנוכל לוודא שהקלדת אותה כראוי.

source: Old password
he: סיסמא ישנה

source: New password
he: סיסמא חדשה

source: Password (again)
he: סיסמא חדשה (שוב)

source: Change my password
he: סיסמא

source: Password change successful
he: הסיסמא שונתה בהצלחה

source: LESSON
he: שיעור

source: LESSON_plural
he: שיעורים

source: LESSON_description
he: שיעור - לימוד מקיף של הנושא על פי היעדים המוגדרים

source: DEMONSTRATION
he: הדגמה

source: DEMONSTRATION_plural
he: הדגמות

source: DEMONSTRATION_description
he: הדגמה - דוגמה ליישום של הנושא או חלקו

source: EXPERIMENT
he: ניסוי

source: EXPERIMENT_plural
he: ניסויים

source: EXPERIMENT_description
he: ניסוי - הצגת מערכת של ניסוי ותוצאותיו

source: PROBLEM_SOLVING
he: פתרון תרגיל

source: PROBLEM_SOLVING_plural
he: פתרונות תרגילים

source: PROBLEM_SOLVING_description
he: פתרון תרגיל

source: ADVANCED
he: העמקה

source: ADVANCED_plural
he: העמקות

source: ADVANCED_description
he: העמקה - העמקה באחד או יותר מיעדי הנושא

source: OTHER
he: אחר

source: OTHER_description
he: אחר - סרטון רלוונטי ומעניין שאינו מתאים לאפשרויות שלעיל

source: OTHER_plural
he: אחר

source: READING
he: הקראה

source: READING_description
he: הקראה או השמעה של טקסט

source: READING_plural
he: הקראות
